{
    "posts":
[{"id":1,
"title": "Jets Trading WR Denzel Mims To Lions - profootballrumors.com",
"body": "The Jets have successfully found a trade partner for wide receiver Denzel Mims, according to a report coming initially from &hellip",
"url": "https://www.fool.com/investing/2023/07/18/move-faang-1-unstoppable-magnificent-7-stock-buy/",
"image": "https://cdn.profootballrumors.com/files/2021/08/USATSI_15247767-1024x741.jpg"
},
{"id":2,
"title": "Asia Cup schedule: It could be 3 India-Pak games in 15 days",
"body": "The fixtures of the Asia Cup was announced on Wednesday with the much anticipated India vs Pakistan encounter scheduled for September 2 in Kandy, Sri Lanka. The arch rivals, who’ve slotted in Group A alongside Nepal may possibly face each other three times in 15 days upon progression to the Super 4 and the final.The tournament will begin on August 30 and run until September 17",
"url": "https://biztoc.com/x/221287e08dd719b2",
"image": "https://images.indianexpress.com/2023/07/IND-PAK-14.jpg"
},
{"id":3,
"title": "I don’t believe in counting my chickens’: Rahul Dravid on India vs Pakistan clash in Asia Cup",
"body": "India, under the tutelage of Rahul Dravid, are set to lock horns against Pakistan in September The Indo-Pak rivalry is one of the most intense in the world and the two heavyweights will collide in the 2023 Asia Cup in Sri Lanka.",
"image": "https://images.indianexpress.com/2022/10/india-vs-pakistan-preview.jpg"
},
{"id":4,
    "title": "India vs West Indies: How overspin makes R Ashwin more effective",
"body": "R Ashwin had the air of a man who has endured one too many swings of misfortune, despite having more than 700 international wickets; somehow the off-spinner has always been on the chopping board. One of the most cliche adages in cricket is “let the bat do the talking.” It’s a batsman game, afterall but in Ashwin’s case, it is different, he has always let his bowling do the talking",
"url": "https://qz.com/elon-musks-brother-and-other-tesla-directors-settled-cl-1850650325",
"image": "https://images.indianexpress.com/2023/07/Ashwin-9.jpg"
},
]
}
